server/load-tests/register-load-test.yml
config:
  target: http://localhost:5000
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Normal load
    - duration: 10
      arrivalRate: 20
      rampTo: 500
      name: Ramp up load
    - duration: 5
      arrivalRate: 500
      rampTo: 5000
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    fake-data: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - post:
          url: "/auth/register"
          json:
            email: "{{ $randEmail() }}"
            username: "{{ $randUserName() }}"
            password: "{{ $randPassword() }}"